
'''Вычислить число π c заданной точностью d
*Пример:* 
- при d = 0.001, π = 3.141.    10^{-1} ≤ d ≤10^{-10}

π = 2√3*(1 - (1/3)*(1/3) + (1/5)*(1/3)^2 - (1/7)*(1/3)^3… + 1/((2n + 1)*(-3)^n)'''

import math
from math import pi



num = int(input('Введите заданную точность: 3'))
n = pi
n = 1000
my_pi = sum(1/16**x*(4/(8*x + 1) - 2/(8*x + 4) - 1/(8*x + 5) - 1/(8*x + 6)) for x in range(n))

print(round(my_pi,num))

