
'''Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
*Пример*
- при [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]   -->    [2, 4, 5, 9]'''



lst_1 = []
lst = [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]



def func(lst):
    for i in lst:
        count = 0
        for j in lst:
            if i == j:
                count += 1
        if count == 1:
            lst_1.append(i)
    return(lst_1)


print(func(lst))


    


        
   

        
    

        